LPCO_COMPOSITE/test/TestGetOrdersOfUser/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:proc="http://j2ee.netbeans.org/wsdl/LPCO_BPEL_MODULE/ProcessOrchestratorOrdersManager">
  <soapenv:Body>
    <proc:GetOrdersOfUserOperation>
      <GetOrdersOfUserOperationRequest>
        <userID>2</userID>
      </GetOrdersOfUserOperationRequest>
    </proc:GetOrdersOfUserOperation>
  </soapenv:Body>
</soapenv:Envelope>